app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Terminator Genisys"], ["rating", "G"], ["release_date", "2015-07-01 00:00:00.000000"], ["created_at", "2015-10-26 01:42:50.899717"], ["updated_at", "2015-10-26 01:42:50.899717"]]
---
  def add_tmdb
    checkedMovies = params[:tmdb_movies]
    puts checkedMovies
    if !(checkedMovies == nil)
      checkedMovies.keys.each do |movie|
        Movie.create_from_tmdb(movie)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)